In [4]:
import pandas as pd
import numpy as np

In [5]:
uper_data = pd.read_csv("Groceries_dataset.csv")

In [6]:
uper_data

       Member_number        Date        itemDescription
0               1808  21-07-2015         tropical fruit
1               2552  05-01-2015             whole milk
2               2300  19-09-2015              pip fruit
3               1187  12-12-2015       other vegetables
4               3037  01-02-2015             whole milk
...              ...         ...                    ...
38760           4471  08-10-2014          sliced cheese
38761           2022  23-02-2014                  candy
38762           1097  16-04-2014               cake bar
38763           1510  03-12-2014  fruit/vegetable juice
38764           1521  26-12-2014               cat food

[38765 rows x 3 columns]

In [7]:
uper_data.head(10)

   Member_number        Date   itemDescription
0           1808  21-07-2015    tropical fruit
1           2552  05-01-2015        whole milk
2           2300  19-09-2015         pip fruit
3           1187  12-12-2015  other vegetables
4           3037  01-02-2015        whole milk
5           4941  14-02-2015        rolls/buns
6           4501  08-05-2015  other vegetables
7           3803  23-12-2015        pot plants
8           2762  20-03-2015        whole milk
9           4119  12-02-2015    tropical fruit

In [8]:
uper_data.tail(5)

       Member_number        Date        itemDescription
38760           4471  08-10-2014          sliced cheese
38761           2022  23-02-2014                  candy
38762           1097  16-04-2014               cake bar
38763           1510  03-12-2014  fruit/vegetable juice
38764           1521  26-12-2014               cat food

In [9]:
uper_data.columns

Index(['Member_number', 'Date', 'itemDescription'], dtype='object')

In [10]:
uper_data.shape

(38765, 3)

In [11]:
uper_data.isnull().any()

Member_number      False
Date               False
itemDescription    False
dtype: bool

In [12]:
uper_data.isnull().sum()

Member_number      0
Date               0
itemDescription    0
dtype: int64

In [13]:
uper_data_1 = uper_data.sample(n = 10000)
uper_data_1

       Member_number        Date   itemDescription
5233            4819  20-09-2015           sausage
28301           1881  18-08-2014               oil
20971           3774  16-09-2015              beef
37361           1607  12-10-2014        rolls/buns
19947           1987  15-10-2015           napkins
...              ...         ...               ...
1553            4434  23-02-2015  other vegetables
10084           3120  10-12-2014         pip fruit
1858            3309  17-05-2015   root vegetables
2871            1584  10-07-2015            yogurt
31385           2982  22-10-2014         margarine

[10000 rows x 3 columns]

In [14]:
uper_data_1 = uper_data.sample(n = 10000, replace = True)
uper_data_1

       Member_number        Date itemDescription
37969           3793  10-12-2014     brown bread
10338           2955  07-06-2014  hamburger meat
18140           3985  20-01-2015    bottled beer
38457           3582  16-06-2014   domestic eggs
1341            1628  05-02-2015         chicken
...              ...         ...             ...
8359            4430  02-12-2015      rolls/buns
35623           4794  11-11-2014    bottled beer
36795           3241  08-01-2014     brown bread
17596           3891  22-11-2015           sugar
32503           4229  06-03-2015      rolls/buns

[10000 rows x 3 columns]

In [15]:
uper_data_1 = uper_data.sample(n = 5)
print(uper_data_1.shape)
uper_data_1

(5, 3)

       Member_number        Date        itemDescription
23862           1444  14-10-2015       hygiene articles
35941           3471  12-10-2015             rolls/buns
22406           1033  15-06-2015                waffles
22355           2152  03-09-2015                 whisky
37872           4185  20-11-2014  fruit/vegetable juice

In [17]:
uper_data_1 = uper_data.sample(n = 5)
print(uper_data_1.shape)
uper_data_1

(5, 3)

       Member_number        Date itemDescription
18880           2985  29-05-2015      whole milk
14095           1697  15-06-2014       pip fruit
8974            2341  17-04-2014     frankfurter
4434            2476  04-12-2015         ketchup
37859           3953  13-05-2014    bottled beer

In [18]:
uper_data.columns

Index(['Member_number', 'Date', 'itemDescription'], dtype='object')

In [19]:
uper_data_2 = uper_data.rename(columns = 
                              {
                                  'START_DATE*' : 'st_date', 
                                  'END_DATE*' : 'en_date', 
                                  'CATEGORY*' : 'cat', 
                                  'START*' : 'start'
                              },
                              inplace = False).head()
uper_data_2.columns

Index(['Member_number', 'Date', 'itemDescription'], dtype='object')

In [20]:
uper_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38765 entries, 0 to 38764
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Member_number    38765 non-null  int64
 1   Date             38765 non-null  object
 2   itemDescription  38765 non-null  object
dtypes: int64(1), object(2)
memory usage: 908.7+ KB

In [21]:
print(uper_data_1)
uper_data_1.describe()

       Member_number        Date itemDescription
18880           2985  29-05-2015      whole milk
14095           1697  15-06-2014       pip fruit
8974            2341  17-04-2014     frankfurter
4434            2476  04-12-2015         ketchup
37859           3953  13-05-2014    bottled beer

       Member_number
count       5.000000
mean     2690.400000
std       841.997506
min      1697.000000
25%      2341.000000
50%      2476.000000
75%      2985.000000
max      3953.000000

In [22]:
uper_data = pd.read_csv("Groceries_dataset.csv")
uper_data.columns

Index(['Member_number', 'Date', 'itemDescription'], dtype='object')

In [23]:
uper_data_c = uper_data.rename(columns = lambda x : x[0:5], inplace = False).head()
uper_data_c.columns

Index(['Membe', 'Date', 'itemD'], dtype='object')